Autodesk.Revit.DB.FormulaManager.GetOperators
Gets list of operator names supported by formula engine

Autodesk.Revit.DB.FormulaManager.GetFunctions
Gets list of function names supported by formula engine

Autodesk.Revit.DB.FormulaManager.Validate(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Document,System.String)
Validates the formuls
Remarks:
It validates formula using list of global or family parameters depends on document type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.FormulaManager.Evaluate(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Document,System.String)
Evaluates value of the formula
Remarks:
It evaluates formula using list of global or family parameters depends on document type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.FormulaManager.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FormulaManager
A class to access and query information about formula engine in Revit models.
Remarks:
Formula manager